Scores on Test: Loss:12.9823379517  MAE:12.9823379517  MSE:341.8295288086  MAPE:27132878.0000000000 
Optimzer: Adamax  Learning_rate: 0.00100  Dense Layer: 1 
Future_candles: 12  Window_size: 12  Drop_out: 0.2 
Epochs: 75  Batch_size: 256  Run_time: 12 min 15 seconds 

Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer_LSTM_id1 (LSTM)  (None, 12, 128)           116224    
_________________________________________________________________
1_h_layer_BatchNorm_id1 (Bat (None, 12, 128)           512       
_________________________________________________________________
1_h_layer_LSTM_id1 (LSTM)    (None, 256)               394240    
_________________________________________________________________
1_dense_layer_id1 (Dense)    (None, 100)               25700     
_________________________________________________________________
Output_layer_id1 (Dense)     (None, 1)                 101       
=================================================================
Total params: 536,777
Trainable params: 536,521
Non-trainable params: 256
_________________________________________________________________
